/**
* Done by:
 * Student Name: Yaroslav Ivanchenko
 * Student Group: 123
 * Lab 1.6
 */

#include <iostream>

int main() {
    // Опис змінних (Для завдання 1)

    int nA;
    float fltB;
    unsigned short wC;

    // Присвоюю значення змінній після створення...    (Навіщо?)

    nA = 19923;
    fltB = -5.87e1;
    wC = 677;

    // Опис змінних (Для завдання 3)

    double dblD;
    int nE;
    char chF; // Результат у змінній chF виглядає некоректно, оскільки значення 677, перевищує діапазон, який може зберігатися в типі char.

    // 4. Ініціювання змінних
    // 4.1. За допомогою неявного приведення типів
    dblD = nA;                // Ціле число неявно перетворюється у double
    nE = fltB;                // Дійсне число неявно перетворюється у int (відкидається дробова частина)
    chF = wC;                 // Беззнакове коротке ціле число неявно перетворюється у char

    // 4.2. За допомогою явного приведення типів
    dblD = (double)nA;        // Явне приведення int до double
    nE = (int)fltB;           // Явне приведення float до int
    chF = (char)wC;           // Явне приведення unsigned short до char

    // 4.3. З обходом суворої типізації

    double *pdblD;            // Вказівник на double
    void *pV;                 // Універсальний вказівник (може вказувати на будь-який тип)

    pV = &nA;                 // Присвоюємо вказівнику pV адресу змінної nA
    pdblD = (double*)pV;      // Явно приводимо pV до вказівника на double
    dblD = *pdblD;            // Присвоюємо значення, на яке вказує pdblD, змінній dblD

    int *pnE;                 // Вказівник на int
    pV = &fltB;               // Присвоюємо pV адресу змінної fltB
    pnE = (int*)pV;           // Явно приводимо pV до вказівника на int
    nE = *pnE;                // Присвоюємо значення, на яке вказує pnE, змінній nE

    char *pchF;               // Вказівник на char
    pV = &wC;                 // Присвоюємо pV адресу змінної wC
    pchF = (char*)pV;         // Явно приводимо pV до вказівника на char
    chF = *pchF;              // Присвоюємо значення, на яке вказує pchF, змінній chF

    std::cout << "Значення змінних після неявного приведення типів:" << std::endl;
    std::cout << "dblD = " << dblD << std::endl;
    std::cout << "nE = " << nE << std::endl;
    std::cout << "chF = " << chF << std::endl; // Результат у змінній chF виглядає некоректно, оскільки значення 677, перевищує діапазон, який може зберігатися в типі char.

    std::cout << "Значення змінних після явного приведення типів:" << std::endl;
    std::cout << "dblD = " << dblD << std::endl;
    std::cout << "nE = " << nE << std::endl;
    std::cout << "chF = " << chF << std::endl; // Результат у змінній chF виглядає некоректно, оскільки значення 677, перевищує діапазон, який може зберігатися в типі char.

    std::cout << "Значення змінних після обходу суворої типізації:" << std::endl;
    std::cout << "dblD = " << dblD << std::endl;
    std::cout << "nE = " << nE << std::endl;
    std::cout << "chF = " << chF << std::endl; // Результат у змінній chF виглядає некоректно, оскільки значення 677, перевищує діапазон, який може зберігатися в типі char.

    return 0;
}