/**
 * Done by:
 * Student Name: Yaroslav Ivanchenko
 * Student Group: 123
 * Lab 1.5
 */

#include <iostream>


int main() {
 // Задаємо значення:
 float A1 = 23.5, B1 = 22, C1 = 34, D1 = 7;

 // Обчислення першого виразу:
 // З таблиці: УЛО1 = !, УЛО2, УЛО3 = ^, БЛО = =, ОВ1, ОВ2 = <=
 // Вираз: <УЛО1> (<УЛО2> (A<ОВ1>B) <БЛО> (<УЛО3> (C<ОВ2>D)
 bool expr1 = !( (A1 <= B1) ^ (C1 <= D1) );

 // Результат першого виразу:
 std::cout << "Результат першого виразу: " << expr1 << std::endl;

 // Значення для другого виразу:
 float A2 = 67, B2 = 67, C2 = 27.4, D2 = 44;

 // Виконуємо обчислення другого виразу:
 bool expr2 = !( (C2 <= D2) ^ (C2 <= D2) );

 // Результат другого виразу:
 std::cout << "Результат другого виразу: " << expr2 << std::endl;

 return 0;
}
